#! /usr/bin/env python
# -*- coding: utf-8 -*-
#打印出100以内的奇数
# for i in range(100):
#    if((i + 1)%2==1):
#       print(i + 1)

#打印出九九乘法表

# for i in range(9):
#    for f in range(i + 1):
#          print(f+1,'X',i + 1,'=',(f+1)*(i+1),"\t",end="")
#    print()

#成绩0-59不及格，60-70及格 70-80 良好 80以上是优秀    [90,100,81,84]判断下改组成绩是否全部都是优秀
# c = 6  # 6代表优秀 7代表不优秀
# for t in[90,100,81,84]:
#     if(t<80):
#        c=6
# if(c==6):
#     print("全部优秀")
# else:
#     print("不全部优秀")

#"01010010001110001001001010101010010101" 计算下几个0 几个1
# w='01010010001110001001001010101010010101'
# q=0 #代表0的个数
# e=0 #代表1的个数
# for d in w:
#     if(d==0):
#         q=q+1
#     else:
#         e=e+1
# print(q,e)


#wheil的循环1+2+3+4...+100

a2=1
for i in range(2):
    a2=a1+2


















