#! /usr/bin/env python
# -*- coding: utf-8 -*-

#字符串截取 切片是左闭右开区间[） 正向数第一位从0开始计数，到哪儿结束：比如要求显示前5个字符 右边应该是6；
#从后往前数还是依旧的左闭右开区间[） [-几：-几） 最后一位是-1 要显示最后一位就是把-1去掉  不写. 倒着表示[::-1].
# q="mnbvczxlkjhgfdsapoiuytrew78-896541230"
# print(q[0:11])
# print(q[-8:])

#字符串切片方法
# 按照扑克牌的规则，现在有6张牌，只要5张
#黑桃（S）红桃（H）方块（D）梅花（C）
#牌：2.3.4.5.6.7.8.9.10.J.Q.K.A
#数据库存的是下面格式的数据，写脚本验证满足3带2的牌型
#[''D1'' , ''H1'' , ''H10'' , ''H7'' , ''S1'' , ''S7'']
#["C9" , "D6" , "D9" , "H13" , "H9" , "S7"]
#["C2" , "D13" , "D2" , "H2" , "H9" , "S13"]
# a='["C9" , "D6" , "D9" , "H13" , "H9" , "S7"]'
# #字符串截取
# print(a[2:-2])
# #重新赋值
# a=a[2:-2]
# #字符串切片
# li = a.split('" , "')
# print(li)

g="[''D1'' , ''H1'' , ''H10'' , ''H7'' , ''S1'' , ''S7'']"
#字符串替换
print(g.replace("''",'"'))
#字符串赋予新值
y=g.replace("''",'"')
#控制台显示内容
print(y)
#字符串截取
a=y[2:-2]
#截取字符串
g_li=a.split('''" , "''')
#转变列表，显示最终控制台内容
print(g_li)






